// Задача 10: Напишите программу, которая принимает на вход трёхзначное число 
// и на выходе показывает вторую цифру этого числа.

// System.Console.Write("Введите трехзначное число ");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num >= 100 && num < 1000 || num <= -100 && num > -1000)
// {
//     System.Console.WriteLine($"Первая цифра числа {num} -> {num / 100}");
//     System.Console.WriteLine($"Вторая цифра числа {num} -> {(num / 10) % 10}");
//     System.Console.WriteLine($"Третья цифра числа {num} -> {num % 10}"); 
// }
// else
// {
//     System.Console.WriteLine("ОШИБКА!!! Число не является трехзначным!");
// }

// Задача 13: Напишите программу, которая выводит третью цифру заданного числа 
// или сообщает, что третьей цифры нет.

// System.Console.Write("Введите число ");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num < 100 && num >= 0 || num > -100 && num <= 0)
// {
//     System.Console.WriteLine("Третьей цифры НЕТ!");
// }
// if (num >= 100 && num <= 999 || num <= -100 && num >= -999)
// {
//     System.Console.WriteLine($"Третья цифра числа {num} -> {num % 10}");
// }
// int n = (num);
// while (n > 999 || n < -999)
// {
// {    
//     n = n / 10;
// }
//     if (n <= 999 && n >= -999)
//     {
//         System.Console.WriteLine($"Третья цифра числа {num} -> {n % 10}");
//     }
// }

// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

// System.Console.Write("Введите цифру дня недели ");
// int day = Convert.ToInt32(Console.ReadLine());
// if (day >= 1 && day < 6)
// {
//     System.Console.WriteLine("Это будний день!");
// }
// if (day >= 6 && day < 8)
// {
//     System.Console.WriteLine("Ура выходной!");
// }
// if (day < 1 || day > 7)
// {
//     System.Console.WriteLine("ОШИБКА!!! Введите число от 1 до 7");
// }
















