// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт,
// какое число большее, а какое меньшее.

// System.Console.Write("Введите первое число ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Введите второе число ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// if (num1 > num2)
// {
//     System.Console.WriteLine($"число {num1} больше числа {num2}");
// }
// if (num1 < num2)
// {
//     System.Console.WriteLine($"число {num1} меньше числа {num2}");
// }
// if (num1 == num2)
// {
//     System.Console.WriteLine("эти числа равны!");
// }

// Задача 4: Напишите программу, которая принимает на вход три числа 
// и выдаёт максимальное из этих чисел.

// System.Console.Write("Введите первое число ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Введите второе число ");
// int num2 = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Введите третье число ");
// int num3 = Convert.ToInt32(Console.ReadLine());
// int max = 0;
// if (num1 > max) max = num1;
// if (num2 > max) max = num2;
// if (num3 > max) max = num3;
// System.Console.WriteLine($"max = {max}");

// Задача 6: Напишите программу, которая на вход принимает число 
// и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// System.Console.Write("Введите число ");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num % 2 == 0)
// {
//     System.Console.WriteLine($"{num} четное число");
// }
// else
// {
//     System.Console.WriteLine($"{num} нечетное число");
// }

// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.

// System.Console.Write("Введите число N ");
// int n = Convert.ToInt32(Console.ReadLine());
// int current = 2;
// while (current <= n)
// {
//     System.Console.Write(current + " ");
//     current = current + 2;
// }
// System.Console.WriteLine();





